Revit 2024 API
LeaderEndCondition Enumeration
 An enumerated type listing Leader end conditions that are supported for IndependentTags.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum LeaderEndCondition
Visual Basic
Public Enumeration LeaderEndCondition
Visual C++
public enum class LeaderEndCondition
Members
Member name | Description
Attached |  The Leader of the tag is attached.
Free |  The Leader of the tag is free.
See Also
Autodesk.Revit.DB Namespace